//Пусть дан LinkedList с несколькими элементами. Реализуйте метод, который вернет “перевернутый”
// список.
//
//==============================================================================================
//
//Реализуйте очередь с помощью LinkedList со следующими методами:
//enqueue() - помещает элемент в конец очереди, dequeue() - возвращает первый элемент из очереди
// и удаляет его, first() - возвращает первый элемент из очереди, не удаляя.
// (Подобную задачу решали на семинаре. Здесь так же нужно создать класс, который
// будет реализовывать указанные методы)
//
// ==============================================================================================
//* В калькулятор добавьте возможность отменить последнюю операцию.
//==============================================================================================
//
//** Реализовать алгоритм перевода из инфиксной записи в постфиксную для арифметического выражения.
// http://primat.org/news/obratnaja_polskaja_zapis/2016-04-09-1181 Вычислить запись если это возможно.
// (Объяснение подобной задачи есть в лекции)

public class s4_task1 {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}